# python for data science - sesi 5
Note :
# Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
# baca datanya
df = pd.read_csv('datasets/nbaallelo.csv')

In [3]:
len(df)

126314

In [4]:
df.shape

(126314, 23)

In [5]:
df.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [6]:
pd.set_option("display.max.columns", None)

In [7]:
df.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.0000,1293.2767,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.0000,1306.7233,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.0000,1309.6521,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,47,1306.7233,1297.0712,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,33,1300.0000,1279.6189,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [8]:
df.tail()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,82,1723.4149,1704.3949,60.309792,GSW,Warriors,103,1790.9591,1809.9791,H,L,0.546572,NaN
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,104,1809.9791,1813.6349,68.013329,CLE,Cavaliers,91,1704.3949,1700.7391,H,W,0.765565,NaN
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,91,1704.3949,1700.7391,60.010067,GSW,Warriors,104,1809.9791,1813.6349,A,L,0.234435,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,97,1700.7391,1692.0859,59.290245,GSW,Warriors,105,1813.6349,1822.2881,H,L,0.481450,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,105,1813.6349,1822.2881,68.519516,CLE,Cavaliers,97,1700.7391,1692.0859,A,W,0.518550,NaN

In [9]:
pd.set_option("display.precision", 2)

In [10]:
df.tail()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,82,1723.41,1704.39,60.31,GSW,Warriors,103,1790.96,1809.98,H,L,0.55,NaN
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,104,1809.98,1813.63,68.01,CLE,Cavaliers,91,1704.39,1700.74,H,W,0.77,NaN
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,91,1704.39,1700.74,60.01,GSW,Warriors,104,1809.98,1813.63,A,L,0.23,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,97,1700.74,1692.09,59.29,GSW,Warriors,105,1813.63,1822.29,H,L,0.48,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,105,1813.63,1822.29,68.52,CLE,Cavaliers,97,1700.74,1692.09,A,W,0.52,NaN

## Getting to know your data

### Dispalying data types

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: float64(6), int64(7), object(10)
memory usage: 17.3+ MB

### Basic statistic

In [12]:
df.describe()

,gameorder,_iscopy,year_id,seasongame,is_playoffs,pts,elo_i,elo_n,win_equiv,opp_pts,opp_elo_i,opp_elo_n,forecast
count,126314.00,126314.0,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00
mean,31579.00,0.5,1988.20,43.53,0.06,102.73,1495.24,1495.24,41.71,102.73,1495.24,1495.24,0.50
std,18231.93,0.5,17.58,25.38,0.24,14.81,112.14,112.46,10.63,14.81,112.14,112.46,0.22
min,1.00,0.0,1947.00,1.00,0.00,0.00,1091.64,1085.77,10.15,0.00,1091.64,1085.77,0.02
25%,15790.00,0.0,1975.00,22.00,0.00,93.00,1417.24,1416.99,34.10,93.00,1417.24,1416.99,0.33
50%,31579.00,0.5,1990.00,43.00,0.00,103.00,1500.95,1500.95,42.11,103.00,1500.95,1500.95,0.50
75%,47368.00,1.0,2003.00,65.00,0.00,112.00,1576.06,1576.29,49.64,112.00,1576.06,1576.29,0.67
max,63157.00,1.0,2015.00,108.00,1.00,186.00,1853.10,1853.10,71.11,186.00,1853.10,1853.10,0.98

### Exploring dataset

In [13]:
df["team_id"].value_counts()

BOS    5997
NYK    5769
LAL    5078
DET    4985
PHI    4533
       ...
INJ      60
TRH      60
DTF      60
PIT      60
SDS      11
Name: team_id, Length: 104, dtype: int64

In [14]:
df["fran_id"].value_counts()

Lakers          6024
Celtics         5997
Knicks          5769
Warriors        5657
Pistons         5650
Sixers          5644
Hawks           5572
Kings           5475
Wizards         4582
Spurs           4309
Bulls           4307
Pacers          4227
Thunder         4178
Rockets         4154
Nuggets         4120
Nets            4106
Suns            4080
Bucks           4034
Trailblazers    3870
Cavaliers       3810
Clippers        3733
Jazz            3555
Mavericks       3013
Heat            2371
Pelicans        2254
Magic           2207
Timberwolves    2131
Grizzlies       1657
Raptors         1634
Hornets          894
Colonels         846
Squires          799
Spirits          777
Stars            756
Sounds           697
Baltimore        467
Floridians       440
Condors          430
Capitols         291
Olympians        282
Sails            274
Stags            260
Bombers          249
Steamrollers     168
Packers           72
Redskins          65
Rebels            63
Denver            62
Waterloo          62
Jets              60
Huskies           60
Ironmen           60
Falcons           60
Name: fran_id, dtype: int64

In [15]:
## cari kenapa lal cuman 5078 sisanya kemana
df.loc[df["fran_id"] == "Lakers", "team_id"].value_counts()

LAL    5078
MNL     946
Name: team_id, dtype: int64

In [16]:
df.loc[df['team_id'] == 'MNL', 'date_game'].min()

'1/1/1949'

In [17]:
df.loc[df['team_id'] == 'MNL', 'date_game'].max()

'4/9/1959'

In [18]:
## ini agregat kalo mau pake 2 fungsi sekali jalan
df.loc[df['team_id'] == 'MNL', 'date_game'].agg(('min','max'))

min    1/1/1949
max    4/9/1959
Name: date_game, dtype: object

In [19]:
df.loc[df["team_id"] == "BOS", "fran_id"].value_counts()

Celtics    5997
Name: fran_id, dtype: int64

In [20]:
## ini mau liat total poin si BOS

df.loc[df["team_id"] == 'BOS', 'pts'].sum()

626484

## Getting to Know Pandas’ Data Structures

### Understanding Series Objects

If you only need to store some key:value pairs, your best and more elegant solution is to use the default dictionary. If you need to make some complex data manipulation on the stored data, then consider using panda's series.

In [21]:
revenues = pd.Series([5555, 7000, 1980])

In [22]:
revenues

0    5555
1    7000
2    1980
dtype: int64

In [23]:
revenues.values

array([5555, 7000, 1980], dtype=int64)

In [24]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [25]:
city_revenues = pd.Series(
    [4200, 34500, 3800],
    index = ['Amsterdam','Jakarta', 'Toronto'])

print(city_revenues)

Amsterdam     4200
Jakarta      34500
Toronto       3800
dtype: int64

In [26]:
## cara buat series yg lebih mudah

city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [27]:
city_employee_count.keys()

Index(['Amsterdam', 'Tokyo'], dtype='object')

In [28]:
print("Tokyo" in city_employee_count)
"New York" in city_employee_count

True

False

### Understanding DataFrame Objects

You can combine these objects into a DataFrame by providing a dictionary in the constructor. The dictionary keys will become the column names, and the values should contain the Series objects:

In [29]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count
})

In [30]:
city_data

           revenue  employee_count
Amsterdam   4200.0             5.0
Jakarta    34500.0             NaN
Tokyo          NaN             8.0
Toronto     3800.0             NaN

In [31]:
city_data.index

Index(['Amsterdam', 'Jakarta', 'Tokyo', 'Toronto'], dtype='object')

In [32]:
city_data.values

array([[4.20e+03, 5.00e+00],
       [3.45e+04,      nan],
       [     nan, 8.00e+00],
       [3.80e+03,      nan]])

In [33]:
city_data.axes[0]

Index(['Amsterdam', 'Jakarta', 'Tokyo', 'Toronto'], dtype='object')

In [34]:
city_data.axes[1]

Index(['revenue', 'employee_count'], dtype='object')

In [35]:
city_data.keys()

Index(['revenue', 'employee_count'], dtype='object')

In [36]:
"Amsterdam" in city_data

False

In [37]:
## cuman bisa buat ngecek fitur aja
"revenue" in city_data

True

In [38]:
### ini nyoba di dataset NBA

df.index

RangeIndex(start=0, stop=126314, step=1)

In [39]:
df.axes

[RangeIndex(start=0, stop=126314, step=1),
 Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
        'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
        'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
        'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes'],
       dtype='object')]

In [40]:
'pts' in df

True

## Accesing series element

### Using indexing operator

In [41]:
city_revenues

Amsterdam     4200
Jakarta      34500
Toronto       3800
dtype: int64

In [42]:
city_revenues["Amsterdam"]

4200

In [43]:
city_revenues["Toronto"]

3800

In [44]:
city_revenues[1:]

Jakarta    34500
Toronto     3800
dtype: int64

In [45]:
city_revenues["Amsterdam":"Toronto"]

Amsterdam     4200
Jakarta      34500
Toronto       3800
dtype: int64

### using .loc and .iLoc
The indexing operator ([]) is convenient, but there’s a caveat. What if the labels are also numbers? Say you have to work with a Series object like this:

In [46]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1, 2, 3, 5, 8]
)

In [47]:
colors

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

In [48]:
## startnya dari 1
colors.loc[1:3]

1       red
2    purple
3      blue
dtype: object

In [49]:
## startnya dari 0
colors.iloc[1:3]

2    purple
3      blue
dtype: object

## Accessing dataframe Element

In [50]:
city_data['revenue']

Amsterdam     4200.0
Jakarta      34500.0
Tokyo            NaN
Toronto       3800.0
Name: revenue, dtype: float64

In [51]:
city_data.revenue ## ini rawan error jika nama kolomnya sama dengan nama suatu function

Amsterdam     4200.0
Jakarta      34500.0
Tokyo            NaN
Toronto       3800.0
Name: revenue, dtype: float64

In [52]:
toys = pd.DataFrame([
    {"name": "ball", "shape": "sphere"},
    {"name": "Rubik's cube", "shape": "cube"}
])

In [53]:
toys["shape"]

0    sphere
1      cube
Name: shape, dtype: object

In [54]:
toys.shape

(2, 2)

### Using loc and iLoc

In [55]:
city_data.loc["Amsterdam"]

revenue           4200.0
employee_count       5.0
Name: Amsterdam, dtype: float64

In [56]:
city_data.loc["Tokyo": "Toronto"]

         revenue  employee_count
Tokyo        NaN             8.0
Toronto   3800.0             NaN

In [57]:
city_data.iloc[1]

revenue           34500.0
employee_count        NaN
Name: Jakarta, dtype: float64

In [58]:
city_data.loc['Amsterdam':,'revenue']

# Note that you separate the parameters with a comma (,). 
# The first parameter, "Amsterdam" : "Tokyo," says to select all rows between 
#     those two labels. The second parameter comes after the comma and says to 
#     select the "revenue" column.

Amsterdam     4200.0
Jakarta      34500.0
Tokyo            NaN
Toronto       3800.0
Name: revenue, dtype: float64

In [59]:
### pake dataset NBA
### kalo banyak kolom yg mau di query pakailah list kurung siku seperti dobawah
df.loc[5555:5559, ['team_id', 'opp_id','pts','opp_pts']]

     team_id opp_id  pts  opp_pts
5555     FTW    PHW   83       56
5556     BOS    NYK   95       74
5557     NYK    BOS   74       95
5558     ROC    SYR   81       86
5559     SYR    ROC   86       81

## Querying dataset

In [60]:
## membuat dataset baru dengan syarat game diatas tahun 2010

current_decade = df[df["year_id"] > 2010]

In [61]:
current_decade.shape

(12658, 23)

In [62]:
game_with_notes = df[df['notes'].notnull()] ## atau pake .notna jg bisa
game_with_notes

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
930,466,194801300BLB,NBA,1,1948,1/30/1948,28,0,WSC,Capitols,71,1469.35,1454.90,47.07,BLB,Baltimore,95,1434.05,1448.50,A,L,0.41,at Baltimore's Fifth Regiment Armory
931,466,194801300BLB,NBA,0,1948,1/30/1948,31,0,BLB,Baltimore,95,1434.05,1448.50,46.41,WSC,Capitols,71,1469.35,1454.90,H,W,0.59,at Baltimore's Fifth Regiment Armory
1084,543,194803230CHS,NBA,1,1948,3/23/1948,49,1,WSC,Capitols,70,1465.90,1461.20,47.71,CHS,Stags,74,1440.72,1445.42,A,L,0.39,Tiebreaker
1085,543,194803230CHS,NBA,0,1948,3/23/1948,49,1,CHS,Stags,74,1440.72,1445.42,46.09,WSC,Capitols,70,1465.90,1461.20,H,W,0.61,Tiebreaker
1088,545,194803250CHS,NBA,1,1948,3/25/1948,49,1,BLB,Baltimore,75,1477.26,1484.31,50.04,CHS,Stags,72,1445.42,1438.36,A,W,0.40,Tiebreaker
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
122207,61104,201401160ATL,NBA,0,2014,1/16/2014,39,0,ATL,Hawks,110,1505.05,1487.59,39.24,BRK,Nets,127,1454.65,1472.11,N,L,0.57,"at London, England"
123916,61959,201411120MIN,NBA,1,2015,11/12/2014,8,0,HOU,Rockets,113,1635.77,1642.45,54.89,MIN,Timberwolves,101,1502.92,1496.24,N,W,0.68,"at Mexico City Arena, Mexico City, Mexico"
123917,61959,201411120MIN,NBA,0,2015,11/12/2014,7,0,MIN,Timberwolves,101,1502.92,1496.24,40.13,HOU,Rockets,113,1635.77,1642.45,N,L,0.32,"at Mexico City Arena, Mexico City, Mexico"
124862,62432,201501150MIL,NBA,0,2015,1/15/2015,40,0,MIL,Bucks,95,1499.90,1505.86,41.14,NYK,Knicks,79,1304.46,1298.50,N,W,0.75,"at The O2, London, England"
124863,62432,201501150MIL,NBA,1,2015,1/15/2015,41,0,NYK,Knicks,79,1304.46,1298.50,21.19,MIL,Bucks,95,1499.90,1505.86,N,L,0.25,"at The O2, London, England"

In [63]:
## You can even access values of the object data type as str and perform
## string methods on them:

ers = df[df["fran_id"].str.endswith("ers")]

In [64]:
ers.shape

(27797, 23)

In [65]:
## Mencari game baltimore dimana 2 tim mendapatkan skor lebih dari 100

df[
    (df["_iscopy"] == 0) &
    (df["pts"] > 100) &
    (df["opp_pts"] > 100) &
    (df["team_id"] == "BLB")
]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
1726,864,194902260BLB,NBA,0,1949,2/26/1949,53,0,BLB,Baltimore,114,1421.94,1419.43,38.56,MNL,Lakers,115,1637.99,1640.49,H,L,0.34,NaN
4890,2446,195301100BLB,NBA,0,1953,1/10/1953,32,0,BLB,Baltimore,126,1328.67,1356.65,25.80,BOS,Celtics,105,1591.14,1563.17,H,W,0.28,NaN
4909,2455,195301140BLB,NBA,0,1953,1/14/1953,34,0,BLB,Baltimore,104,1349.83,1346.36,24.88,MNL,Lakers,112,1665.44,1668.91,H,L,0.22,NaN
5208,2605,195303110BLB,NBA,0,1953,3/11/1953,66,0,BLB,Baltimore,107,1284.52,1282.24,19.58,NYK,Knicks,113,1649.15,1651.44,H,L,0.18,at Boston MA
5825,2913,195402220BLB,NBA,0,1954,2/22/1954,60,0,BLB,Baltimore,110,1303.75,1301.97,20.74,BOS,Celtics,111,1591.49,1593.27,H,L,0.25,at Worcester MA

In [66]:
df[
    (df["_iscopy"] == 0) &
    (df["team_id"].str.startswith("LA")) &
    (df["year_id"] == 1992) &
    (df["notes"].notnull())
]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
68901,34451,199205030LAC,NBA,0,1992,5/3/1992,86,1,LAC,Clippers,115,1546.90,1556.0,47.89,UTA,Jazz,107,1647.51,1638.41,H,W,0.50,"at Anaheim, CA (Anaheim Convention Center)"
68903,34452,199205030LAL,NBA,0,1992,5/3/1992,86,1,LAL,Lakers,76,1489.65,1474.4,39.40,POR,Trailblazers,102,1655.12,1670.37,H,L,0.41,"at Las Vegas, NV"

## Grouping and Aggregating Your Data

In [67]:
city_revenues.sum()

42500

In [68]:
city_revenues.max()

34500

In [69]:
points = df["pts"]

In [70]:
points.sum()

12976235

In [71]:
# A DataFrame can have multiple columns, which introduces new possibilities 
# for aggregations, like grouping:

df.groupby("fran_id", sort=False)["pts"].sum()

fran_id
Huskies           3995
Knicks          582497
Stags            20398
Falcons           3797
Capitols         22387
Celtics         626484
Steamrollers     12372
Ironmen           3674
Bombers          17793
Rebels            4474
Warriors        591224
Baltimore        37219
Jets              4482
Pistons         572758
Lakers          637444
Kings           569245
Hawks           567261
Denver            4818
Olympians        22864
Redskins          5372
Waterloo          4921
Packers           6193
Sixers          585891
Wizards         474809
Bulls           437269
Thunder         437735
Squires          91127
Stars            84940
Rockets         432504
Colonels         94435
Pacers          438288
Nuggets         445780
Spurs           453822
Spirits          85874
Sounds           75582
Floridians       49568
Nets            417809
Condors          49642
Bucks           418326
Suns            437486
Clippers        380523
Cavaliers       380416
Trailblazers    402695
Sails            30080
Jazz            363155
Mavericks       309239
Pelicans        220794
Heat            229103
Timberwolves    207693
Magic           219436
Grizzlies       157683
Raptors         158370
Hornets          84489
Name: pts, dtype: int64

In [72]:
df[
    (df['fran_id'] == 'Warriors') &
    (df['year_id'] > 2012)
].groupby(['year_id','is_playoffs', 'game_result'])['game_id'].count()

year_id  is_playoffs  game_result
2013     0            L              35
                      W              47
         1            L               6
                      W               6
2014     0            L              31
                      W              51
         1            L               4
                      W               3
2015     0            L              15
                      W              67
         1            L               5
                      W              16
Name: game_id, dtype: int64

## manipulating Columns

In [73]:
## Mengcopy data frame

nba = df.copy()

In [74]:
nba.shape

(126314, 23)

In [75]:
## Membuat kolom baru

nba["difference"] = df.pts - df.opp_pts

In [76]:
nba.shape

(126314, 24)

In [77]:
nba["difference"].max()

68

In [78]:
## me rename kolom yg sudah ada

renamed_nba = nba.rename(
    columns={"game_result": "result", "game_location": "location"}
)

renamed_nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 24 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   gameorder    126314 non-null  int64
 1   game_id      126314 non-null  object
 2   lg_id        126314 non-null  object
 3   _iscopy      126314 non-null  int64
 4   year_id      126314 non-null  int64
 5   date_game    126314 non-null  object
 6   seasongame   126314 non-null  int64
 7   is_playoffs  126314 non-null  int64
 8   team_id      126314 non-null  object
 9   fran_id      126314 non-null  object
 10  pts          126314 non-null  int64
 11  elo_i        126314 non-null  float64
 12  elo_n        126314 non-null  float64
 13  win_equiv    126314 non-null  float64
 14  opp_id       126314 non-null  object
 15  opp_fran     126314 non-null  object
 16  opp_pts      126314 non-null  int64
 17  opp_elo_i    126314 non-null  float64
 18  opp_elo_n    126314 non-null  float64
 19  location     126314 non-null  object
 20  result       126314 non-null  object
 21  forecast     126314 non-null  float64
 22  notes        5424 non-null    object
 23  difference   126314 non-null  int64
dtypes: float64(6), int64(8), object(10)
memory usage: 18.3+ MB

In [79]:
elo_columns = ["elo_i", "elo_n", "opp_elo_i", "opp_elo_n"]

In [80]:
## Ngedrop kolom dari list diatas

nba.drop(elo_columns, inplace=True, axis=1)##KALO UDAH PAKE INPLACE MAKA HASILNYA PERMANEN

In [81]:
nba

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,win_equiv,opp_id,opp_fran,opp_pts,game_location,game_result,forecast,notes,difference
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,40.29,NYK,Knicks,68,H,L,0.64,NaN,-2
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,41.71,TRH,Huskies,66,A,W,0.36,NaN,2
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,42.01,NYK,Knicks,47,H,W,0.63,NaN,16
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,47,40.69,CHS,Stags,63,A,L,0.37,NaN,-16
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,33,38.86,WSC,Capitols,50,H,L,0.64,NaN,-17
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,82,60.31,GSW,Warriors,103,H,L,0.55,NaN,-21
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,104,68.01,CLE,Cavaliers,91,H,W,0.77,NaN,13
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,91,60.01,GSW,Warriors,104,A,L,0.23,NaN,-13
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,97,59.29,GSW,Warriors,105,H,L,0.48,NaN,-8
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,105,68.52,CLE,Cavaliers,97,A,W,0.52,NaN,8

## Specifying datatypes

In [85]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 20 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  datetime64[ns]
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  win_equiv      126314 non-null  float64
 12  opp_id         126314 non-null  object
 13  opp_fran       126314 non-null  object
 14  opp_pts        126314 non-null  int64
 15  game_location  126314 non-null  object
 16  game_result    126314 non-null  object
 17  forecast       126314 non-null  float64
 18  notes          5424 non-null    object
 19  difference     126314 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(8), object(9)
memory usage: 14.9+ MB

In [84]:
## mengubah data date_game jadi date

nba['date_game'] = pd.to_datetime(nba['date_game'])

In [86]:
## melihat ada berapa tipe pada suatu kolom

nba['game_location'].nunique()

3

In [87]:
nba['game_location'].value_counts()

H    63138
A    63138
N       38
Name: game_location, dtype: int64

In [89]:
## mengubah jadi categorical
nba['game_location'] = pd.Categorical(nba['game_location'])

In [90]:
## ngecek datatypenya
nba['game_location'].dtype

CategoricalDtype(categories=['A', 'H', 'N'], ordered=False)

## Missing values

In [91]:
no_mv = nba.dropna() ## ini kalo ada 1 kololmnya ada yg gakeisi maka akan dihapus

In [92]:
no_mv.shape

(5424, 20)

In [95]:
no_mv_column = nba.dropna(axis = 1) ## bakal ngedrop KOLOM yg punya missing value

In [94]:
no_mv_column.shape

(126314, 19)

In [96]:
data_with_default_notes = nba.copy()

In [97]:
### ngisi missing value dengan "no notes at all"

data_with_default_notes["notes"].fillna(
    value="no notes at all",
    inplace=True
)

In [98]:
data_with_default_notes["notes"].describe()

count              126314
unique                232
top       no notes at all
freq               120890
Name: notes, dtype: object

## Invalid Values

In [100]:
nba.describe()

,gameorder,_iscopy,year_id,seasongame,is_playoffs,pts,win_equiv,opp_pts,forecast,difference
count,126314.00,126314.0,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00
mean,31579.00,0.5,1988.20,43.53,0.06,102.73,41.71,102.73,0.50,0.00
std,18231.93,0.5,17.58,25.38,0.24,14.81,10.63,14.81,0.22,13.37
min,1.00,0.0,1947.00,1.00,0.00,0.00,10.15,0.00,0.02,-68.00
25%,15790.00,0.0,1975.00,22.00,0.00,93.00,34.10,93.00,0.33,-9.00
50%,31579.00,0.5,1990.00,43.00,0.00,103.00,42.11,103.00,0.50,0.00
75%,47368.00,1.0,2003.00,65.00,0.00,112.00,49.64,112.00,0.67,9.00
max,63157.00,1.0,2015.00,108.00,1.00,186.00,71.11,186.00,0.98,68.00

In [101]:
nba[nba["pts"] == 0]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,win_equiv,opp_id,opp_fran,opp_pts,game_location,game_result,forecast,notes,difference
26684,13343,197210260VIR,ABA,1,1973,1972-10-26,7,0,DNR,Nuggets,0,40.41,VIR,Squires,2,A,L,0.33,at Richmond VA; forfeit to VIR,-2

### inconsistent values

In [102]:
nba[(nba["pts"] > nba["opp_pts"]) & (nba["game_result"] != 'W')].empty

True

In [103]:
nba[(nba["pts"] < nba["opp_pts"]) & (nba["game_result"] != 'L')].empty

True

## Combining multiple datasets

In [114]:
## buat baris baru
further_city_data = pd.DataFrame(
    {"revenue": [23411,3400], "employee_count": [2, 2]},
    index=["New York", "Barcelona"]
)

In [115]:
all_city_data = pd.concat([city_data, further_city_data], sort=False)

In [116]:
all_city_data

           revenue  employee_count
Amsterdam   4200.0             5.0
Jakarta    34500.0             NaN
Tokyo          NaN             8.0
Toronto     3800.0             NaN
New York   23411.0             2.0
Barcelona   3400.0             2.0

In [117]:
## buat kolom baru

city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"]
)

In [118]:
## karena mau tambah kolom baru jadi AXIS = 1
cities = pd.concat([all_city_data, city_countries], axis=1, sort=False)

In [119]:
cities

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Jakarta    34500.0             NaN      NaN      NaN
Tokyo          NaN             8.0    Japan      1.0
Toronto     3800.0             NaN   Canada      0.0
New York   23411.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0

In [120]:
## ini kalo mau join antar 2 tabel biar kalo ada yg miss di tinggalkan
pd.concat([all_city_data, city_countries], axis=1, join="inner")

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland        1
Tokyo          NaN             8.0    Japan        1
Toronto     3800.0             NaN   Canada        0
Barcelona   3400.0             2.0    Spain        0

In [123]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])

countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [125]:
## ini join pake index(key) yg mau dijoin yg mana

pd.merge(cities, countries, left_on="country", right_index=True)

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17,Europe
Rotterdam,NaN,NaN,Holland,0.0,17,Europe
Tokyo,NaN,8.0,Japan,1.0,127,Asia
Toronto,3800.0,NaN,Canada,0.0,37,North America

In [129]:
## kalo dijoin dan di tampilin semua pake parameter how = "left"(left join)
pd.merge(
    cities,
    countries,
    left_on="country",
    right_index=True,
    how="left"
)

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17.0,Europe
Jakarta,34500.0,NaN,NaN,NaN,NaN,NaN
Tokyo,NaN,8.0,Japan,1.0,127.0,Asia
Toronto,3800.0,NaN,Canada,0.0,37.0,North America
New York,23411.0,2.0,NaN,NaN,NaN,NaN
Barcelona,3400.0,2.0,Spain,0.0,NaN,NaN
Rotterdam,NaN,NaN,Holland,0.0,17.0,Europe

## Visualizing your pandas dataframe

In [1]:
## supaya dishow langsung di notebook
%matplotlib inline

In [2]:
nba[nba["fran_id"] == "Knicks"].groupby("year_id")["pts"].sum().plot()

NameError: name 'nba' is not defined

In [3]:
nba[nba["fran_id"] == "Knicks"].groupby("year_id")["pts"].sum()

NameError: name 'nba' is not defined

In [4]:
nba["fran_id"].value_counts().head(10).plot(kind="bar")

NameError: name 'nba' is not defined

In [5]:
nba["fran_id"].value_counts().head(10)

NameError: name 'nba' is not defined